"""! @en_brief Entry module 
@ru_brief Стартовый модуль

@ru_details Точка входа в прогамму. Запускется из командной строки `> python main.py`, другой способ - импортировать модуль `main` в скрипт и запускать фунцию `start_script()`.
Подробности см. в `start_script()`. При инциализации модуля вызывается `gs`: `ProjectSettings`) - Объект, содержащий базовые настройки программы.  
`gs` оределяет, кроме прочего, абсолютный путь к папке испоняемого кода (абсолютный/путь/hypotez/src) 

@ru_todo  `GUI`, `JUPYTER` интерфейсы требуют переосмысления

"""

